# ZoneAirVolumeCalculationTypeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneAirVolumeCalculationTypeParam Property
ParameterTypeId Class See Also
---
"Air Volume Calculation Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneAirVolumeCalculationTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneAirVolumeCalculationTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneAirVolumeCalculationTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace